""" 
Уставшие от необычно теплой зимы, жители решили узнать,
действительно ли это самая длинная оттепель за всю историю
наблюдений за погодой. Они обратились к синоптикам, а те, в
свою очередь, занялись исследованиями статистики за
прошлые годы. Их интересует, сколько дней длилась самая
длинная оттепель. Оттепелью они называют период, в
который среднесуточная температура ежедневно превышала
0 градусов Цельсия. Напишите программу, помогающую
синоптикам в работе.
Пользователь вводит число N – общее количество
рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках
располагается N целых чисел.
Каждое число – среднесуточная температура в
соответствующий день. Температуры – целые числа и лежат в
диапазоне от –50 до 50

Input: 6 -> -20 30 -40 50 10 -10
Output: 2 
"""
n = int(input("Введите общее кол-во рассматриваемых дней: "))
""" count = 0
for i in range(n):
    x = int(input("Введите среднесуточную температуру: "))
    if x > 0:
        count += 1
    elif x < 0 and i < n - 1 and count > 1:
        count = 0
print(count) """

# Макарцев
days_plus = 0
max_days_plus = 0
for i in range(n):
    temp = int(input("Введите температуру: "))
    if temp > 0:
        days_plus += 1
        if max_days_plus < days_plus:
            max_days_plus = days_plus
    else:
        days_plus = 0
print(max_days_plus)