""" 
Требуется вычислить, сколько раз встречается некоторое 
число k в массиве list_1.

Найдите количество и выведите его.

list_1 = [1, 2, 3, 4, 5]
k = 3
-> 1

Требуется вычислить, сколько раз встречается некоторое 
число X в массиве A[N]. Пользователь в первой строке 
вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. 
Последняя строка содержит число X

5
1 2 3 4 5
3
-> 1
"""
list_1 = [1, 2, 3, 4, 5, 3]
k = 3

count = 0
for i in range(len(list_1)):
    if list_1[i] == k:
        count += 1
print(count)
