""" 
Заполните массив элементами арифметической прогрессии. 
Её первый элемент, разность и количество элементов нужно 
ввести с клавиатуры. Формула для получения n-го члена прогрессии: 
an = a1 + (n-1) * d.
Каждое число вводится с новой строки.

Ввод: 7 2 5
Вывод: 7 9 11 13 15 
"""
a = int(input("Введите первый элемент: "))
d = int(input("Введите разность: "))
n = int(input("Введите количество элементов: "))
print(*[a + i * d for i in range(n)])

# Решение с функцией высшего порядка
a0, n, d = map(int, input("Введите значение прогрессии: ").split())
print(*[a0 + (i - 1) * d for i in range(1, n + 1)])
